'''Big - O 표기법
빅오 표기법은 알고리즘의 효율성을 표기해주는 기법
알고리즘의 효율성은 데이터 개수(n)가 주어졌을 때 덧셈,곱셈 같은 기본 연산의 횟수를 의미
빅오 표기법은 보통 알고리즘의 시간 복잡도와 공간 복잡도를 나타내는데 주로 사용
시간복잡도- 알고리즘의 시간 효울성을 의미
공간복잡도- 알고리즘의 공간(메모리)효울성을 의미
Big-O 표기법 종류
1. O(1)
2. O(n)
3. O(log n)
4. O(n2)
5. O(2n)
O(1): 일정한 복잡도라고 하며, 입력값이 증가하더라도 시간이 늘어나지 않는다(크기에 관계없이, 즉시 출력값을 얻어낼 수 있다)
O(n): 선형복잡도라고 부르며, 입력값이 증가함에 따라 시간 또한 같은 비율로 증가하는 것을 의미
O(log n): 로그복잡도라고 부르며, 빅오 표기법중 O(1) 다음으로 빠른 시간 복잡도를 가진다.
BST의 값 탐색이 이와같ㅌ은 로직으로, O(log n)의 시간 복잡도를 가진 알고리즘(탐색기법)이다.
O(n2 n*2가 아니고  n^2이다): 2차복잡도라고 부르며, 입력값이 증가함에 따라 시간이 n의 제곱수의 비율로 증가하는 것을 의미'
O(2n): 기하급수적 복잡도라고 부르며, 빅오 표기법중 가장 느린 시간 복잡도를 가진다.'''

